---
kind: property
id: P:Autodesk.Revit.DB.LayoutRuleMaximumSpacing.Spacing
source: html/73687269-c6fe-2519-3e41-e66cf556da9a.htm
---
# Autodesk.Revit.DB.LayoutRuleMaximumSpacing.Spacing Property

Get or set the spacing of the beam system.

## Syntax (C#)
```csharp
public double Spacing { get; set; }
```

## Remarks
The value of spacing must be in (0, 30000), but in fact the spacing
should not be too small or too great.